In [2]:
#read the file
example1 = "Week4 example1.txt"
file1 = open(example1, "r")

In [3]:
# Print the path of file
file1.name

'Week4 example1.txt'

In [4]:
# Print the mode of file, either 'r' or 'w'
file1.mode

'r'

In [5]:
#We can read the file and assign it to a variable
FileContent = file1.read()
FileContent

'This is line 1\nthis is line 2\nThis is line 3'

In [6]:
# Print the file with '\n' as a new line
print(FileContent)

This is line 1
this is line 2
This is line 3

In [7]:
# Type of file content
type (FileContent)

str

In [8]:
# Close file after finish
file1.close()

In [10]:
#better way to open a file using with
with open("Week4 example1.txt", "r") as file1:
    FileContent = file1.read()
    print(FileContent)

This is line 1
this is line 2
This is line 3

In [11]:
# Read first four characters
with open(example1, "r") as file1:
    print(file1.read(4))

This

In [12]:
# Read certain amount of characters
with open(example1, "r") as file1:
    print(file1.read(4))
    print(file1.read(4))
    print(file1.read(7))
    print(file1.read(15))

This
 is
line 1

this is line 2

In [13]:
with open(example1, "r") as file1:
    print(file1.read(16))
    print(file1.read(5))
    print(file1.read(9))

This is line 1
t
his i
s line 2

In [14]:
# Read one line

with open(example1, "r") as file1:
    print("first line: " + file1.readline())

first line: This is line 1

In [15]:
with open(example1, "r") as file1:
    print(file1.readline(20)) # does not read past the end of line

This is line 1

In [16]:
with open(example1, "r") as file1:
    print(file1.read(20)) # Returns the next 20 chars

This is line 1
this

In [17]:
# Iterate through the lines

with open(example1,"r") as file1:
        i = 0;
        for line in file1:
            print("Iteration", str(i), ": ", line)
            i = i + 1

Iteration 0 :  This is line 1

Iteration 1 :  this is line 2

Iteration 2 :  This is line 3

In [18]:
# Read all lines and save as a list

with open(example1, "r") as file1:
    FileasList = file1.readlines()

In [19]:
# Print the first line

FileasList[0]

'This is line 1\n'

In [20]:
FileasList[1]

'this is line 2\n'

In [21]:
FileasList[2]

'This is line 3'

# Writing Files with Open

In [23]:
# Write line to file
exmp2 = 'Week4 Example2.txt'
with open(exmp2, 'w') as writefile:
    writefile.write("This is line A")

In [24]:
# Read file

with open(exmp2, 'r') as testwritefile:
    print(testwritefile.read())

This is line A

In [25]:
# Write lines to file

with open(exmp2, 'w') as writefile:
    writefile.write("This is line A\n")
    writefile.write("This is line B\n")

In [26]:
# Check whether write to file

with open(exmp2, 'r') as testwritefile:
    print(testwritefile.read())

This is line A
This is line B

In [27]:
#write a list to a .txt file
Lines = ["This is line A\n", "This is line B\n", "This is line C\n"]
Lines

['This is line A\n', 'This is line B\n', 'This is line C\n']

In [28]:
# Write the strings in the list to text file

with open('Week4 Example2.txt', 'w') as writefile:
    for line in Lines:
        print(line)
        writefile.write(line)

This is line A

This is line B

This is line C

In [29]:
# Verify if writing to file is successfully executed

with open('Week4 Example2.txt', 'r') as testwritefile:
    print(testwritefile.read())

This is line A
This is line B
This is line C

In [31]:
with open('Week4 Example2.txt', 'w') as writefile:
    writefile.write("Overwrite\n")
with open('Week4 Example2.txt', 'r') as testwritefile:
    print(testwritefile.read())

Overwrite

# Appending Files

In [33]:
# Write a new line to text file

with open('Week4 Example2.txt', 'a') as testwritefile:
    testwritefile.write("This is line C\n")
    testwritefile.write("This is line D\n")
    testwritefile.write("This is line E\n")

In [35]:
# Verify if the new line is in the text file

with open('Week4 Example2.txt', 'r') as testwritefile:
    print(testwritefile.read())

Overwrite
This is line C
This is line D
This is line E

In [36]:
#a+ : Appending and Reading. Creates a new file, if none exists.
with open('Week4 Example2-2.txt', 'a+') as testwritefile:
    testwritefile.write("This is line E\n")
    print(testwritefile.read())

## Opening the file in w is akin to opening the .txt file, moving your cursor to the beginning of the text file, writing new text and deleting everything that follows. Whereas opening the file in a is similiar to opening the .txt file, moving your cursor to the very end and then adding the new pieces of text.

In [38]:
with open('Week4 Example2-2.txt', 'a+') as testwritefile:
    print("Initial Location: {}".format(testwritefile.tell()))
    
    data = testwritefile.read()
    if (not data):  #empty strings return false in python
            print('Read nothing') 
    else: 
            print(testwritefile.read())
            
    testwritefile.seek(0,0) # move 0 bytes from beginning.
    
    print("\nNew Location : {}".format(testwritefile.tell()))
    data = testwritefile.read()
    if (not data): 
            print('Read nothing') 
    else: 
            print(data)
    
    print("Location after read: {}".format(testwritefile.tell()) )

Initial Location: 16
Read nothing

New Location : 0
This is line E

Location after read: 16

# Pandas

In [40]:
import pandas as pd

In [41]:
#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [42]:
#Retrieving the "ID" column and assigning it to a variable x
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [43]:
#check the type of x
type(x)

pandas.core.frame.DataFrame

In [44]:
#Retrieving the Department, Salary and ID columns and assigning it to a variable z

z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [49]:
import pandas as pd
x = {'Student': ['David','Samuel', 'Terry', 'Evan'], 'Age': ['27', '24', '22', '32'], 'Country': ['UK', 'Canada', 'China', 'USA'], 
      'Course':['Python', 'Data Structures', 'Machine Learning', 'Web Development'], 'Marks': ['85', '72', '89', '76']}
df= pd.DataFrame(x)
df

  Student Age Country            Course Marks
0   David  27      UK            Python    85
1  Samuel  24  Canada   Data Structures    72
2   Terry  22   China  Machine Learning    89
3    Evan  32     USA   Web Development    76

In [54]:
b = df[['Marks']]
b

  Marks
0    85
1    72
2    89
3    76

In [57]:
c = df[['Country', 'Course']]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

In [100]:
import pandas as pd
#To view the column as a series, just use one bracket
y= {'Name': ['David', 'Tooba', 'Junaid', 'Rayyan']}
x = df['Name']
x

0    Rose
1    John
2    Jane
3    Mary
Name: Name, dtype: object

In [62]:
#check the type of x
type(x)

pandas.core.series.Series

In [63]:
# Access the value on the first row and the first column

df.iloc[0, 0]

'David'

In [64]:
# Access the value on the first row and the third column

df.iloc[0,2]

'UK'

In [66]:
# Access the column using the name

df.loc[0, 'Marks']

'85'

In [102]:
df2=df
df2=df2.set_index("Name")

In [70]:
#To display the first 5 rows of new dataframe
df2.head()

  Student Age Country            Course Marks
0   David  27      UK            Python    85
1  Samuel  24  Canada   Data Structures    72
2   Terry  22   China  Machine Learning    89
3    Evan  32     USA   Web Development    76

In [75]:
#Now, let us access the column using the name
df2.loc[1, 'Age']

'24'

In [93]:
z = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}


df = pd.DataFrame(z)


df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [103]:
df.loc['Jane', 'Salary']

KeyError: 'Jane'

In [81]:
df2.iloc[3,2]

'Infrastructure'

In [91]:
# let us do the slicing using old dataframe df

df.iloc[0:2, 0:3]

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group

In [95]:
#let us do the slicing using loc() function on old dataframe df where index column is having labels as 0,1,2
df.loc[0:2,'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [96]:
#let us do the slicing using loc() function on new dataframe df1 where index column is Name having labels: Rose, John and Jane
df2.loc['Rose':'Jane', 'ID':'Department']

Empty DataFrame
Columns: [ID, Department]
Index: []

In [98]:
df.loc[2:4, 'Name':'Department']

   Name  ID      Department
2  Jane   3     Design Team
3  Mary   4  Infrastructure

In [104]:
# Dependency needed to install file 

!pip install xlrd

Requirement already satisfied: xlrd in c:\users\administrator\anaconda3\lib\site-packages (2.0.1)

In [105]:
# Import required library

import pandas as pd

In [106]:
# Read data from CSV file

csv_path = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/labs/Module%204/data/TopSellingAlbums.csv'
df = pd.read_csv(csv_path)

In [109]:
# Print first five rows of the dataframe

df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,0:42:19,"pop, rock, R&B",46.0,65,30-Nov-82,NaN,10.0
1,AC/DC,Back in Black,1980,0:42:11,hard rock,26.1,50,25-Jul-80,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,0:42:49,progressive rock,24.2,45,01-Mar-73,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,0:57:44,"R&B, soul, pop",27.4,44,17-Nov-92,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,0:46:33,"hard rock, progressive rock",20.6,43,21-Oct-77,NaN,8.0

In [110]:
# Read data from Excel File and print the first five rows

xlsx_path = 'https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Datasets/TopSellingAlbums.xlsx'

df = pd.read_excel(xlsx_path)
df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,00:42:19,"pop, rock, R&B",46.0,65,1982-11-30,NaN,10.0
1,AC/DC,Back in Black,1980,00:42:11,hard rock,26.1,50,1980-07-25,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,00:42:49,progressive rock,24.2,45,1973-03-01,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,00:57:44,"R&B, soul, pop",27.4,44,1992-11-17,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,00:46:33,"hard rock, progressive rock",20.6,43,1977-10-21,NaN,8.0

In [111]:
# Access to the column Length

x = df[['Length']]
x

     Length
0  00:42:19
1  00:42:11
2  00:42:49
3  00:57:44
4  00:46:33
5  00:43:08
6  01:15:54
7  00:40:01

In [112]:
# Get the column as a series

x = df['Length']
x

0    00:42:19
1    00:42:11
2    00:42:49
3    00:57:44
4    00:46:33
5    00:43:08
6    01:15:54
7    00:40:01
Name: Length, dtype: object

In [116]:
# Get the column as a dataframe

x = df[['Artist']]
type(x)

pandas.core.frame.DataFrame

In [117]:
# Access to multiple columns

y = df[['Artist','Length','Genre']]
y

            Artist    Length                        Genre
0  Michael Jackson  00:42:19               pop, rock, R&B
1            AC/DC  00:42:11                    hard rock
2       Pink Floyd  00:42:49             progressive rock
3  Whitney Houston  00:57:44               R&B, soul, pop
4        Meat Loaf  00:46:33  hard rock, progressive rock
5           Eagles  00:43:08   rock, soft rock, folk rock
6         Bee Gees  01:15:54                        disco
7    Fleetwood Mac  00:40:01                    soft rock

In [118]:
# Access the value on the first row and the first column

df.iloc[0, 0]

'Michael Jackson'

In [121]:
# Access the value on the second row and the first column

df.iloc[1,0]

'AC/DC'

In [120]:
# Access the value on the first row and the third column

df.iloc[0,2]

1982

In [122]:
# Access the column using the name

df.loc[0, 'Artist']

'Michael Jackson'

In [123]:
# Slicing the dataframe

df.iloc[0:2, 0:3]

            Artist          Album  Released
0  Michael Jackson       Thriller      1982
1            AC/DC  Back in Black      1980

In [124]:
# Slicing the dataframe

df.iloc[0:2, 0:3]

            Artist          Album  Released
0  Michael Jackson       Thriller      1982
1            AC/DC  Back in Black      1980

# Quiz

In [126]:
q= df[['Rating']]

In [127]:
q = df[['Released', 'Artist']]
q

   Released           Artist
0      1982  Michael Jackson
1      1980            AC/DC
2      1973       Pink Floyd
3      1992  Whitney Houston
4      1977        Meat Loaf
5      1976           Eagles
6      1977         Bee Gees
7      1977    Fleetwood Mac